
zrp = [22000, 15000, 19500, 24000, 20000, 12365, 23000]

count = 0
for i in zrp:
    if(i < 20000):
        count += 1
print(f"Кол-во работников заробатывающих менее 20000 равно: {count} чел.")

# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||

n = "311"       # Ищем где припаркован авто с номером 311
parking = ["-", "-", "132", "155", "-", "521", "-", "311", "555", "839"]

park = None
p1 = 0

while (park == None and p1 < len(parking)):
    if (parking[p1] == n):
        park = p1
    p1 += 1
if (park != None):
    print(f"Автомобиль стоит на {park} месте")
else:
    print("Автомобиля на стоянке нет")

# Ту же программу можно написать через цикл for =====================================================================

n = "311"       # Ищем где припаркован авто с номером 311
parking = ["-", "-", "132", "155", "311", "521", "-", "-", "555", "839"]

park = None

for i in range(len(parking)):
    if(parking[i] == n):
        park = i # Приравниваем park к индексу в списке который укажет на номер авто(значение) который выведем в print

if (park != None):
    print(f"Автомобиль стоит на {park} месте")
else:
    print("Автомобиля на стоянке нет")

# Преимущество цикла while преред for в том что операция перебора заканчивается сразу после того как (park != None)
# В то время как for будет перебирать все элементы
# |||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||||