
def findPath(a, x, y, number):
    a[x][y] = number
    if (a[x + 1][y] == 0):                  # Первое условие рекурсии, проверяющее путь вниз (стенка = -1, проход = 0)
        findPath(a, x + 1, y, number + 1)

    if (a[x][y + 1] == 0):                  # Второе условие рекурсии, проверяющее путь вправо
        findPath(a, x, y + 1, number + 1)



a = []
a.append([-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1])
a.append([-1,  0, -1,  0,  0,  0, -1,  0,  0,  0, -1])
a.append([-1,  0,  0,  0, -1,  0, -1,  0, -1,  0, -1])
a.append([-1,  0, -1,  0, -1,  0,  0,  0, -1,  0, -1])
a.append([-1,  0, -1,  0, -1, -1, -1, -1, -1,  0, -1])
a.append([-1,  0, -1,  0,  0,  0,  0,  0, -1,  0, -1])
a.append([-1,  0, -1, -1, -1, -1, -1, -1, -1,  0, -1])
a.append([-1,  0,  0,  0,  0,  0,  0,  0, -1,  0, -1])
a.append([-1, -1, -1, -1, -1, -1, -1, -1, -1, -1, -1])

findPath(a, 1, 1, 1)

